9/data/attachments/90ad886e736f3978.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_6bd045c0-8a46-4d9b-95cf-0d090beffbf7</nif:username>
            <nif:friendToBeAdded>Michael_writer_Actions_90577_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>